# CircuitPathOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..CircuitPathOffset Property
ElectricalSetting Class See Also
---
The default circuit path offset for newly created circuit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double CircuitPathOffset { get; set; }
```

Visual Basic
---
```text
Public Property CircuitPathOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CircuitPathOffset {
	double get ();
	void set (double value);
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace